Blintii/esp32_bt_player/main/codec/ach_reg.h
 *        |                 |            | 1 = Power up
 * -------+-----------------+------------+--------------------------------------------------
 *  3     | SPKR            | 0          | SPK_RP/SPK_RN Output Buffers
 *        |                 |            | 0 = Power down
 *        |                 |            | 1 = Power up
 * -------+-----------------+------------+--------------------------------------------------
 *  2 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  1     | OUT3            | 0          | OUT3 Output Buffer
 *        |                 |            | 0 = Power down
 *        |                 |            | 1 = Power up
 * -------+-----------------+------------+--------------------------------------------------
 *  0     | PLLEN           | 0          | PLL Enable
 *        |                 |            | 0 = Power down
 *        |                 |            | 1 = Power up
 */
    struct {
        uint16_t PLLEN: 1;
        uint16_t OUT3: 1;
        uint16_t reserved2: 1;
        uint16_t SPKR: 1;
        uint16_t SPKL: 1;
        uint16_t ROUT1: 1;
        uint16_t LOUT1: 1;
        uint16_t DACR: 1;
        uint16_t DACL: 1;
    } R26_PowerManagment_2;
/*
 * R27 (1Bh) Additional Control (3)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8:7 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  6     | VROI            | 0          | VREF to Analogue Output Resistance
 *        |                 |            | (Disabled Outputs)
 *        |                 |            | 0 = 500Ω VMID to output
 *        |                 |            | 1 = 20kΩ VMID to output
 * -------+-----------------+------------+--------------------------------------------------
 *  5:4 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  3     | OUT3CAP         | 0          | Capless Mode Headphone Switch Enable
 *        |                 |            | 0 = OUT3 unaffected by jack detect events
 *        |                 |            | 1 = OUT3 enabled and disabled together with HP_L
 *        |                 |            |     and HP_R in response to jack detect events
 * -------+-----------------+------------+--------------------------------------------------
 *  2:0   | ADC_ALC_SR      | 000        | ALC Sample Rate
 *        |                 |            | 000 = 44.1k / 48k
 *        |                 |            | 001 = 32k
 *        |                 |            | 010 = 22.05k / 24k
 *        |                 |            | 011 = 16k
 *        |                 |            | 100 = 11.25k / 12k
 *        |                 |            | 101 = 8k
 *        |                 |            | 110 and 111 = Reserved
 */
    struct {
        uint16_t ADC_ALC_SR: 3;
        uint16_t OUT3CAP: 1;
        uint16_t reserved4: 2;
        uint16_t VROI: 1;
        uint16_t reserved7: 2;
    } R27_AdditionalControl_3;
/*
 * R28 (1Ch) Anti-Pop (1)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7     | POBCTRL         | 0          | Selects the bias current source for output
 *        |                 |            | amplifiers and VMID buffer
 *        |                 |            | 0 = VMID / R bias
 *        |                 |            | 1 = VGS / R bias
 * -------+-----------------+------------+--------------------------------------------------
 *  6:5 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  4     | BUFDCOPEN       | 0          | Enables the VGS / R current generator
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  3     | BUFIOEN         | 0          | Enables the VGS / R current generator and the
 *        |                 |            | analogue input and output bias
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  2     | SOFT_ST         | 0          | Enables VMID soft start
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  1 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  0     | HPSTBY          | 0          | Headphone Amplifier Standby
 *        |                 |            | 0 = Standby mode disabled (Normal operation)
 *        |                 |            | 1 = Standby mode enabled
 */
    struct {
        uint16_t HPSTBY: 1;
        uint16_t reserved1: 1;
        uint16_t SOFT_ST: 1;
        uint16_t BUFIOEN: 1;
        uint16_t BUFDCOPEN: 1;
        uint16_t reserved5: 2;
        uint16_t POBCTRL: 1;
        uint16_t reserved8: 1;
    } R28_AntiPop_1;
/*
 * R29 (1Dh) Anti-Pop (2)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8:7 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  6     | DISOP           | 0          | Discharges the DC-blocking headphone capacitors
 *        |                 |            | on HP_L and HP_R
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  5:4   | DRES[1:0]       | 00         | DRES determines the value of the resistors used
 *        |                 |            | to discharge the DC-blocking headphone
 *        |                 |            | capacitors when DISOP=1
 *        |                 |            | 00 = 400Ω
 *        |                 |            | 01 = 200Ω
 *        |                 |            | 10 = 600Ω
 *        |                 |            | 11 = 150Ω
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0 - reserved
 */
    struct {
        uint16_t reserved0: 4;
        uint16_t DRES: 2;
        uint16_t DISOP: 1;
        uint16_t reserved7: 2;
    } R29_AntiPop_2;
    uint16_t R30_Reserved: 9;
    uint16_t R31_Reserved: 9;
    uint16_t R32_ADCLSignalPath: 9;
    uint16_t R33_ADCRSignalPath: 9;
/*
 * R34 (22h) Left Out Mix
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8     | LD2LO           | 0          | Left DAC to Left Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  7     | LI2LO           | 0          | LINPUT3 to Left Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  6:4   | LI2LOVOL[2:0]   | 101        | LINPUT3 to Left Output Mixer Volume
 *        |                 |            | 000 = 0dB
 *        |                 |            | ... 3dB steps up to
 *        |                 |            | 111 = -21dB
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0 - reserved
 */
    struct {
        uint16_t reserved0: 4;
        uint16_t LI2LOVOL: 3;
        uint16_t LI2LO: 1;
        uint16_t LD2LO: 1;
    } R34_LeftOutMix;
    uint16_t R35_Reserved: 9;
    uint16_t R36_Reserved: 9;
/*
 * R37 (25h) Right Out Mix
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8     | RD2RO           | 0          | Right DAC to Right Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  7     | RI2RO           | 0          | RINPUT3 to Right Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  6:4   | RI2ROVOL[2:0]   | 101        | RINPUT3 to Right Output Mixer Volume
 *        |                 |            | 000 = 0dB
 *        |                 |            | ... 3dB steps up to
 *        |                 |            | 111 = -21dB
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0 - reserved
 */
    struct {
        uint16_t reserved0: 4;
        uint16_t RI2ROVOL: 3;
        uint16_t RI2RO: 1;
        uint16_t RD2RO: 1;
    } R37_RightOutMix;
    uint16_t R38_MonoOutMix_1: 9;
    uint16_t R39_MonoOutMix_2: 9;
    uint16_t R40_LeftSpeakerVolume: 9;
    uint16_t R41_RightSpeakerVolume: 9;
    uint16_t R42_OUT3Volume: 9;
    uint16_t R43_LeftInputBoostMixer: 9;
    uint16_t R44_RightInputBoostMixer: 9;
/*
 * R45 (2Dh) Left Bypass
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7     | LB2LO           | 0          | Left Input Boost Mixer to Left Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  6:4   | LB2LOVOL[2:0]   | 101        | Left Input Boost Mixer to Left Output Mixer
 *        |                 |            | Volume
 *        |                 |            | 000 = 0dB
 *        |                 |            | ... 3dB steps up to
 *        |                 |            | 111 = -21dB
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0 - reserved
 */
    struct {
        uint16_t reserved0: 4;
        uint16_t LB2LOVOL: 3;
        uint16_t LB2LO: 1;
        uint16_t reserved8: 1;
    } R45_LeftBypass;
/*
 * R46 (2Eh) Right Bypass
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7     | RB2RO           | 0          | Right Input Boost Mixer to Right Output Mixer
 *        |                 |            | 0 = Disable (Mute)
 *        |                 |            | 1 = Enable Path
 * -------+-----------------+------------+--------------------------------------------------
 *  6:4   | RB2ROVOL[2:0]   | 101        | Right Input Boost Mixer to Right Output Mixer
 *        |                 |            | Volume
 *        |                 |            | 000 = 0dB
 *        |                 |            | ... 3dB steps up to
 *        |                 |            | 111 = -21dB
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0 - reserved
 */
    struct {
        uint16_t reserved0: 4;
        uint16_t RB2ROVOL: 3;
        uint16_t RB2RO: 1;
        uint16_t reserved8: 1;
    } R46_RightBypass;
/*
 * R47 (2Fh) Power management (3)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8:6 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  5     | LMIC            | 0          | Left Channel Input PGA Enable
 *        |                 |            | 0 = PGA disabled
 *        |                 |            | 1 = PGA enabled (if AINL = 1)
 * -------+-----------------+------------+--------------------------------------------------
 *  4     | RMIC            | 0          | Right Channel Input PGA Enable
 *        |                 |            | 0 = PGA disabled
 *        |                 |            | 1 = PGA enabled (if AINR = 1)
 * -------+-----------------+------------+--------------------------------------------------
 *  3     | LOMIX           | 0          | Left Output Mixer Enable Control
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  2     | ROMIX           | 0          | Right Output Mixer Enable Control
 *        |                 |            | 0 = Disabled
 *        |                 |            | 1 = Enabled
 * -------+-----------------+------------+--------------------------------------------------
 *  1:0 - reserved
 */
    struct {
        uint16_t reserved0: 2;
        uint16_t ROMIX: 1;
        uint16_t LOMIX: 1;
        uint16_t RMIC: 1;
        uint16_t LMIC: 1;
        uint16_t reserved6: 3;
    } R47_PowerManagement_3;
    uint16_t R48_AdditionalControl_4: 9;
    uint16_t R49_ClassDControl_1: 9;
    uint16_t R50_Reserved: 9;
    uint16_t R51_ClassDControl_2: 9;
/*
 * R52 (34h) PLL (1)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8:6   | OPCLKDIV[2:0]   | 000        | SYSCLK Output to GPIO Clock Division ratio
 *        |                 |            | 000 = SYSCLK
 *        |                 |            | 001 = SYSCLK / 2
 *        |                 |            | 010 = SYSCLK / 3
 *        |                 |            | 011 = SYSCLK / 4
 *        |                 |            | 100 = SYSCLK / 5.5
 *        |                 |            | 101 = SYSCLK / 6
 * -------+-----------------+------------+--------------------------------------------------
 *  5     | SDM             | 0          | 0 = Integer mode
 *        |                 |            | 1 = Fractional mode
 * -------+-----------------+------------+--------------------------------------------------
 *  4     | PLLPRESCALE     | 0          | 0 = Divide MCLK by 1 before input to PLL
 *        |                 |            | 1 = Divide MCLK by 2 before input to PLL
 * -------+-----------------+------------+--------------------------------------------------
 *  3:0   | PLLN[3:0]       | 1000 (8)   | Integer (N) part of PLL input/output
 *        |                 |            | frequency ratio.
 *        |                 |            | Use values greater than 5 and less than 13
 */
    struct {
        uint16_t PLLN: 4;
        uint16_t PLLPRESCALE: 1;
        uint16_t SDM: 1;
        uint16_t OPCLKDIV: 3;
    } R52_PLL_1;
/*
 * R53 (35h) PLL (2)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7:0   | PLLK[23:16]     | 0011 0001  | Fractional (K) part of PLL1 input/output
 *        |                 | 31h        | frequency ratio (treat as one 24-digit binary
 *        |                 |            | number)
 */
    struct {
        uint16_t PLLK: 8;
        uint16_t reserved8: 1;
    } R53_PLL_2;
/*
 * R54 (36h) PLL (3)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7:0   | PLLK[15:8]      | 0010 0110  | Fractional (K) part of PLL1 input/output
 *        |                 | 26h        | frequency ratio (treat as one 24-digit binary
 *        |                 |            | number)
 */
    struct {
        uint16_t PLLK: 8;
        uint16_t reserved8: 1;
    } R54_PLL_3;
/*
 * R55 (37h) PLL (4)
 *
 *  bits  | label           | default    | description
 * -------+-----------------+------------+--------------------------------------------------
 *  8 - reserved
 * -------+-----------------+------------+--------------------------------------------------
 *  7:0   | PLLK[7:0]       | 1110 1001  | Fractional (K) part of PLL1 input/output
 *        |                 | E9h        | frequency ratio (treat as one 24-digit binary
 *        |                 |            | number)
 */
    struct {
        uint16_t PLLK: 8;
        uint16_t reserved8: 1;
    } R55_PLL_4;
} ach_reg_WM8960;


#endif /* __ACH_REG_H__ */
